<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="obs_0" type="Parameter" version="opset1">
			<data shape="?,10" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="obs_0">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="obs_1" type="Parameter" version="opset1">
			<data shape="?,17" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="obs_1">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_1719_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 10" offset="0" size="20" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_1719" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_1703" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1720_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 10" offset="20" size="20" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1720" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/network_body/observation_encoder/processors.0/normalizer/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/observation_encoder/processors.0/normalizer/Div_output_0">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/network_body/observation_encoder/processors.0/normalizer/Clip" type="Clamp" version="opset1">
			<data min="-5" max="5" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/network_body/observation_encoder/processors.0/normalizer/Clip_output_0">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_1721_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 17" offset="40" size="34" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_1721" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_1707" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_1722_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 17" offset="74" size="34" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1722" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/network_body/observation_encoder/processors.1/normalizer/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/observation_encoder/processors.1/normalizer/Div_output_0">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/network_body/observation_encoder/processors.1/normalizer/Clip" type="Clamp" version="opset1">
			<data min="-5" max="5" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/network_body/observation_encoder/processors.1/normalizer/Clip_output_0">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/network_body/observation_encoder/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/observation_encoder/Concat_output_0">
					<dim>-1</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="network_body._body_endoder.seq_layers.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 27" offset="108" size="13824" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="network_body._body_endoder.seq_layers.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="network_body._body_endoder.seq_layers.0.weight">
					<dim>256</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/network_body/_body_endoder/seq_layers/seq_layers.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_1723_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="13932" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_1723" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/network_body/_body_endoder/seq_layers/seq_layers.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.0/Gemm_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/network_body/_body_endoder/seq_layers/seq_layers.1/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.1/Mul_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="network_body._body_endoder.seq_layers.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="14444" size="131072" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="network_body._body_endoder.seq_layers.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="network_body._body_endoder.seq_layers.2.weight">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/network_body/_body_endoder/seq_layers/seq_layers.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_1724_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="145516" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_1724" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/network_body/_body_endoder/seq_layers/seq_layers.2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.2/Gemm_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/network_body/_body_endoder/seq_layers/seq_layers.3/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.3/Mul_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="network_body._body_endoder.seq_layers.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="146028" size="131072" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="network_body._body_endoder.seq_layers.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="network_body._body_endoder.seq_layers.4.weight">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/network_body/_body_endoder/seq_layers/seq_layers.4/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_1725_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="277100" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_1725" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/network_body/_body_endoder/seq_layers/seq_layers.4/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.4/Gemm_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/network_body/_body_endoder/seq_layers/seq_layers.5/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/network_body/_body_endoder/seq_layers/seq_layers.5/Mul_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="action_model._continuous_distribution.mu.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 256" offset="277612" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="action_model._continuous_distribution.mu.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="action_model._continuous_distribution.mu.weight">
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/_continuous_distribution/mu/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_1726_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3" offset="279148" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_1726" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/_continuous_distribution/mu/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_continuous_distribution/mu/Gemm_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Clip_1" type="Clamp" version="opset1">
			<data min="-3" max="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Clip_1_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1727_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="279154" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_1727" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="deterministic_continuous_actions" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="deterministic_continuous_actions">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="continuous_action_output_shape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="279156" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="continuous_action_output_shape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="continuous_act_size_vector,continuous_action_output_shape,version_number,version_number.1">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ShapeOf_59" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_62" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="279158" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_63_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="279162" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_63" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="RandomUniform_64" type="RandomUniform" version="opset8">
			<data output_type="f32" op_seed="0" global_seed="0" alignment="tensorflow" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Log_73" type="Log" version="opset1">
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_1728_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="279164" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_1728" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Multiply_74" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Sqrt_75" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_1729_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="279166" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1729" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_77" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Cos_78" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Multiply_79" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RandomNormalLike_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_1730_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="279168" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_1730" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/_continuous_distribution/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_continuous_distribution/Mul_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="action_model._continuous_distribution.log_sigma_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3" offset="279170" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="action_model._continuous_distribution.log_sigma" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="action_model._continuous_distribution.log_sigma">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/_continuous_distribution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_continuous_distribution/Add_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/_continuous_distribution/Exp" type="Exp" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/_continuous_distribution/Exp_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Mul_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/Clip" type="Clamp" version="opset1">
			<data min="-3" max="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Clip_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_1731_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="279154" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_1731" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="continuous_actions" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="continuous_actions">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="memory_size_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="279168" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="memory_size" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="memory_size,memory_size_vector">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="version_number/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
		</layer>
		<layer id="83" name="memory_size/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
		</layer>
		<layer id="80" name="continuous_actions/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
		<layer id="51" name="continuous_action_output_shape/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
		</layer>
		<layer id="48" name="deterministic_continuous_actions/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="1" to-layer="40" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="43" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="0" />
		<edge from-layer="42" from-port="1" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="52" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="69" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="75" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="47" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1" />
		<edge from-layer="47" from-port="2" to-layer="48" to-port="0" />
		<edge from-layer="49" from-port="0" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="84" to-port="0" />
		<edge from-layer="52" from-port="1" to-layer="56" to-port="0" />
		<edge from-layer="53" from-port="0" to-layer="56" to-port="1" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="56" to-port="2" />
		<edge from-layer="56" from-port="3" to-layer="57" to-port="0" />
		<edge from-layer="56" from-port="3" to-layer="64" to-port="1" />
		<edge from-layer="57" from-port="1" to-layer="60" to-port="0" />
		<edge from-layer="58" from-port="0" to-layer="59" to-port="0" />
		<edge from-layer="59" from-port="1" to-layer="60" to-port="1" />
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0" />
		<edge from-layer="61" from-port="1" to-layer="66" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="0" />
		<edge from-layer="63" from-port="1" to-layer="64" to-port="0" />
		<edge from-layer="64" from-port="2" to-layer="65" to-port="0" />
		<edge from-layer="65" from-port="1" to-layer="66" to-port="1" />
		<edge from-layer="66" from-port="2" to-layer="74" to-port="0" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="0" />
		<edge from-layer="68" from-port="1" to-layer="69" to-port="1" />
		<edge from-layer="69" from-port="2" to-layer="72" to-port="0" />
		<edge from-layer="70" from-port="0" to-layer="71" to-port="0" />
		<edge from-layer="71" from-port="1" to-layer="72" to-port="1" />
		<edge from-layer="72" from-port="2" to-layer="73" to-port="0" />
		<edge from-layer="73" from-port="1" to-layer="74" to-port="1" />
		<edge from-layer="74" from-port="2" to-layer="75" to-port="1" />
		<edge from-layer="75" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="76" from-port="1" to-layer="79" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="78" to-port="0" />
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1" />
		<edge from-layer="79" from-port="2" to-layer="80" to-port="0" />
		<edge from-layer="81" from-port="0" to-layer="82" to-port="0" />
		<edge from-layer="82" from-port="1" to-layer="83" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<Runtime_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<conversion_parameters>
			<input_model value="DIR\FinalAgent.onnx" />
			<is_python_api_used value="False" />
			<output_dir value="C:\Users\Michal\Documents\GitHub\AI-Parking-Assistant\OpenVINOoptimizer\optimized_model" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
